HiMyCocoo/air-quality-monitor/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=y
CONFIG_AIRMON_SCD41_I2C_PORT_NUM=0
CONFIG_AIRMON_SCD41_I2C_SDA_GPIO=8
CONFIG_AIRMON_SCD41_I2C_SCL_GPIO=9
CONFIG_AIRMON_SGP41_I2C_PORT_NUM=0
CONFIG_AIRMON_SGP41_I2C_SDA_GPIO=8
CONFIG_AIRMON_SGP41_I2C_SCL_GPIO=9
CONFIG_AIRMON_BMP390_I2C_PORT_NUM=0
CONFIG_AIRMON_BMP390_I2C_SDA_GPIO=8
CONFIG_AIRMON_BMP390_I2C_SCL_GPIO=9
CONFIG_AIRMON_BMP390_I2C_ADDRESS=0x77
CONFIG_AIRMON_SPS30_UART_PORT_NUM=1
CONFIG_AIRMON_SPS30_UART_TX_GPIO=17
CONFIG_AIRMON_SPS30_UART_RX_GPIO=18
CONFIG_AIRMON_SPS30_UART_BAUD_RATE=115200
CONFIG_AIRMON_SPS30_AUTO_CLEANING_INTERVAL_SEC=604800
